Tekla.Structures.ModelInternal.LoftedPlateValidityStatus
This enumeration represents the error codes returned by the Core transactions that have to do with base
curve manipulation

Tekla.Structures.ModelInternal.LoftedPlateValidityStatus.Valid
Validity code for a valid lofted plate

Tekla.Structures.ModelInternal.LoftedPlateValidityStatus.InvalidCurveCombination
Validity code for an invalid lofted plate due to an invalid combination of base curves

Tekla.Structures.ModelInternal.LoftedPlateValidityStatus.SomeRulingIsZero
Validity code for an invalid lofted plate due to intersecting base curves

Tekla.Structures.ModelInternal.LoftedPlateValidityStatus.SelfIntersectingSolid
Validity code for an invalid lofted plate due to a self intersecting solid

Tekla.Structures.ModelInternal.LoftedPlateValidityStatus.UnknownError
Validity code for an invalid lofted plate due to an unknown reason